In [1]:
import mysql.connector as conn

In [2]:
mydb = conn.connect(host = "localhost", user = "root", passwd = "mysql")

In [3]:
cursor = mydb.cursor()

In [4]:
cursor.execute('use assim_sql')

In [5]:
cursor.execute('SELECT * FROM worker_table')
cursor.fetchall()

[(1,
  'Mukesh shrestha',
  'Top level',
  230000,
  datetime.datetime(2014, 2, 11, 0, 0)),
 (2,
  'Sabita Malla',
  'Account',
  55000,
  datetime.datetime(2011, 9, 23, 9, 34, 21)),
 (3,
  'Binay Panjiyar',
  'Account',
  41000,
  datetime.datetime(2014, 11, 27, 10, 35, 29)),
 (4, 'Sujan Joshi', 'Cash', 63000, datetime.datetime(2014, 2, 2, 10, 43, 39)),
 (5, 'Ram Shah', 'Driver', 32500, datetime.datetime(2014, 3, 5, 11, 35, 23)),
 (6,
  'Hari Lama',
  'Marketing',
  115300,
  datetime.datetime(2014, 2, 19, 10, 45, 13)),
 (7,
  'Bishal Kumar',
  'Top level',
  215000,
  datetime.datetime(2014, 3, 16, 12, 39, 10)),
 (8,
  'Kavi Bhatari',
  'Top level',
  215000,
  datetime.datetime(2016, 9, 22, 12, 39, 10)),
 (9,
  'Amitabh Bhata',
  'CEO',
  350000,
  datetime.datetime(2016, 9, 22, 11, 23, 17)),
 (10,
  'Vipul Sarma',
  'Marketing',
  123500,
  datetime.datetime(2014, 2, 24, 11, 23, 17)),
 (11,
  'Satish Kumar',
  'Marketing',
  123500,
  datetime.datetime(2013, 3, 22, 11, 23, 17))]

In [6]:
"""Assignment_10"""

'Assignment_10'

In [7]:
"""Q-19. Write an SQL query to determine the 5th highest salary without using TOP or limit
method."""

cursor.execute('SELECT * FROM(SELECT Id, First_Name, Department, Salary, ROW_NUMBER() OVER(ORDER BY Salary DESC) AS 5th_Highest_Salary FROM worker_table) AS N HAVING 5th_Highest_Salary = 5')
cursor.fetchall()

[(10, 'Vipul Sarma', 'Marketing', 123500, 5)]

In [13]:
"""Q-20. Write an SQL query to fetch the list of employees with the same salary."""

cursor.execute('SELECT DISTINCT we1.Id, we2.First_Name, we1.Department, we1.Salary FROM worker_table we1, worker_table we2 WHERE we1.Salary = we2.Salary AND we1.Id != we2.Id')
cursor.fetchall()

[(8, 'Bishal Kumar', 'Top level', 215000),
 (7, 'Kavi Bhatari', 'Top level', 215000),
 (11, 'Vipul Sarma', 'Marketing', 123500),
 (10, 'Satish Kumar', 'Marketing', 123500)]